<template>
	<view class="components-home mybg">
		<cu-custom bgColor="bg-gradual-blue" :isBack="true">
			<block slot="backText">返回</block>
			<block slot="content">网上问诊</block>
		</cu-custom>
		
	  <view>
		<button block @click="bottomVisible1 = true" class="mybutton">肚子痛了怎么办？</button>
		<button block @click="bottomVisible2 = true" class="mybutton">指甲上出现白点？</button>
		<button block @click="bottomVisible3 = true" class="mybutton">中暑怎么办？</button>
		<button block @click="bottomVisible4 = true" class="mybutton">热中风了怎么办？</button>
		<button block @click="bottomVisible5 = true" class="mybutton">水中毒了怎么办？</button>
		<button block @click="bottomVisible6 = true" class="mybutton">肠道传染病如何处理？</button>
		<button block @click="bottomVisible7 = true" class="mybutton">坐骨神经痛怎么处理？</button>
		<button block @click="bottomVisible8 = true" class="mybutton">感冒怎么样好得快？</button>
		<button block @click="bottomVisible9 = true" class="mybutton">经常四肢发凉怎么处理？</button>
		<button block @click="bottomVisible10 = true" class="mybutton">皮肤过敏怎么处理？</button>
		<button block @click="bottomVisible11 = true" class="mybutton">皮炎湿疹怎么处理？</button>

		<navigator open-type="navigate" url="/page_cure/cure_item/cure_human">
			<button class="blueBtn cu-btn bg-blue shadow lg">转人工</button>
		</navigator>
		<view style="height: 1rpx;width: 1rpx;"></view>
	  </view>

		<s-popup v-model="bottomVisible1" position="bottom" round background="rgb(2,0,36) linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%)" height="500" >
			<text class="mypop" >
				肚子痛的原因:
					一、饭钱饭后疼痛可能是胃炎
					如果经常在饭钱饭后出现疼痛的话，那么就需要注意，因为这种情况可能是胃炎导致的，胃炎的影响还是比较大的，不仅影响食欲更会影响心情，对于胃炎一般来说主要通过药物进行治疗。
					二、如果肚脐附近经常疼痛要考虑是否为小肠病变
					众所周知，人的肚脐位置主要是小肠，所以如果是这个部位的疼痛，可以去医院检查一下看是否为小肠病变导致的。
					三、右下腹疼痛可能是阑尾炎
					当饭后出现右下腹疼痛的情况，可以考虑一下是否是患上了阑尾炎导致的。
					四、暴食后疼痛可能是急性胃扩张
					生活节奏快、精神压力大，很多人会选择通过暴饮暴食来减肥，如果短时间内吃太多的食物会导致急性胃扩张，其主要症状表现就是肚子疼痛难忍，对于此类情况需要及时去医院接受治疗，以免发生危险。
					五、吃生冷食物后导致疼痛多是肠易激综合征
					很多朋友在吃了生冷的食物之后，就非常容易出现腹泻、肚子不舒服的情况，这种一般是肠易激综合征所导致的，虽然说这种问题不会给我们的生命带来威胁，但是也会降低我们的生活质量，给日常生活和工作带来很多的不便，所以要及时的治疗。
					六、疼痛时还有烧心的感觉，有可能是胃食管反流导致
					如果在肚子疼痛的同时，出现烧心以及食欲减退的情况，则有可能是胃食管反流导致的，这种情况下应该避免油腻辛辣刺激食物、拒绝碳酸饮料、避免进食过多等等。
					七、肋骨交界处疼痛需要高度警惕
					当肚子疼的时候伴随肋骨交界处疼痛，则有可能是心脏疾病，尤其是中老年人对于此类情况需要高度重视，及早去医院检查。
				处理办法：
					请根据自身情况判断是否需要去医院。
			</text>
		</s-popup>
		<s-popup v-model="bottomVisible2" position="bottom" round background="rgb(2,0,36) linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%)" height="500" >
			<text class="mypop">
				原因：
					手指甲上长出白点或者是白斑很有可能是手指甲受到了损伤，在日常生活当中，指甲受到损伤是一种非常常见的状况。如果在按下手指甲的过程当中有一定的疼痛，就一定要及时的注意，要不然会对身体健康造成很大的伤害。受到了真菌感染以后手指甲上就经常容易出现白斑或者是白点。
					并且这种情况会随着时间的推移不断的扩散，一种会影响到身体健康，所以为了避免这种情况，出现白斑白点并且按压手指有痛感的时候一定要及时的治疗。
				处理办法：
					如果是缺钙就多喝一些牛奶，对于身体缺少何种微量元素还是要及时到医院做好详细的检查，对于正在长身体的孩子来说，如果出现缺乏微量元素的情况，对他们的成长和健康都是非常不利的。
			</text>
		</s-popup>
		<s-popup v-model="bottomVisible3" position="bottom" round background="rgb(2,0,36) linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%)" height="500" >
			<text class="mypop">
				中暑的原因：
					中暑是指在温度或湿度较高、不透风的环境下，因体温调节中枢功能障碍或汗腺功能衰竭，以及水、电解质丢失过多，从而发生的以中枢神经和（或）心血管功能障碍为主要表现的急性疾病。
				症状：
					出现头痛、头晕、口渴、多汗等症状
				处理办法：
					先兆中暑和轻度中暑患者一般经现场救护可以恢复正常。严重者请前往医院
			</text>
		</s-popup>
		<s-popup v-model="bottomVisible4" position="bottom" round background="rgb(2,0,36) linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%)" height="500" >
			<text class="mypop">
				热中风的原因：
					热中风一般都是由于天气比较热，而且这段时间经常外出所导致的，中风一般老年人患病比较多，而且可能会出现头晕的情况，热中风一般可能会出现恶心呕吐的情况，也有可能会出现失眠多梦。在日常生活中一定要注意有一个良好的睡眠质量发生热中风之后一定要及时的送往医院，避免延误病。
				症状：
					发生热中风的前兆主要有：血压突然大幅度波动，且伴有 头昏眼花或耳鸣耳聋；头昏头痛突然加重或由间断性头痛变为 持续性剧烈的头痛，伴有恶心呕吐；突然出现一时性一侧肢体发麻、无力，或活动不灵，或口舌发麻，吐字不清；精神和性 格突然发生改变，变得沉默寡言、表情淡漠，或急躁多语、烦躁 不安，或出现短暂的判断和智力障碍，或突然发生嗜睡状态，即昏昏沉沉总想睡觉；严重者突然发生原 因不明的跌跋和昏倒等。
				处理办法：
					由于高温散热的需要，血流向外周皮肤分配，造成大脑血流量的锐减，这对心血管调节功能不良及因脑动脉硬化原本供血不足的病人，将进一步加剧大脑的缺血，从而诱发脑梗塞；高温酷热易使人心情烦躁，情绪变化较大，引起血压波动，继而诱发中风。治疗与普通中风基本一样，控制症状，溶栓治疗。建议去3甲医院就诊治疗。
			</text>
		</s-popup>
		<s-popup v-model="bottomVisible5" position="bottom" round background="rgb(2,0,36) linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%)" height="500" >
			<text class="mypop">
				水中毒的原因：
					1.抗利尿激素（ADH）泌过多
					各种原因导致的抗利尿激素分泌过多，可见于恐惧、失血、休克、急性感染（如肺炎、中毒性痢疾等）、应用止痛剂（如吗啡、哌替啶），或疼痛、手术等应激刺激。手术后ADH分泌增多的时间通常持续12～36小时，或更长。在此情况下过多输入葡萄糖等不含电解质的溶液，就容易发生水中毒。此外甲状腺功能低下的晚期发生部液性水肿的患者也可以通过压力感受器的刺激使ADH分泌增多，肾上腺皮质功能不全时也可有ADH的异常释放。
					2.肾功能障碍
					急性肾衰竭的少尿无尿期，肾脏的稀释和浓缩功能都发生障碍，此时水分摄入过多，容易发生水中毒。此外，任何原因使肾血流量不足或肾小球血液灌注量严重减少，过多的水分不能排出，在合并低渗性的情况下，水中毒容易发生。
					3.入水过多
					机体摄入过多的水分，如慢性精神病患者的原发性多饮。某些医源性因素如静脉输液过多、催产素或垂体后叶素的应用。此时细胞外液量明显增加，血清钠浓度降低，渗透压亦下降，导致过多的水进入细胞内。
			症状：
				1.急性水中毒
				发病急，由于细胞内外液量增多，颅腔和椎管无弹性，脑细胞水肿造成颅内压增高症状，如头痛，失语，精神错乱，定向力失常，嗜睡，躁动，谵妄，甚至昏迷，进一步发展，有发生脑疝的可能，以致呼吸、心跳骤停。重者有充血性心力衰竭、呼吸急促（发生肺水肿时）、胸腔积液、充血性肝肿大、颈静脉怒张、肺动脉压和中心静脉压增高、骶部或四肢末端的水肿。若血钠在48小时内迅速降至108mmol/L以下，可致神经系统永久性损伤或死亡。
				2.慢性水中毒
				症状一般不明显，往往被原发疾病的症状所掩盖，可有软弱无力，恶心呕吐，嗜睡等，体重增加，皮肤苍白而湿润。当血浆渗透压降至240～250mOsm/L（血钠115～120mmol/L）时，会出现头痛、嗜睡、神志错乱、谵妄等神经精神症状。当血浆渗透压降至230mOsm/L（血钠110mmol/L）时，可发现抽搐或昏迷。
			处理办法：
				水中毒一经诊断应立即停止水分摄入，并积极治疗原发疾病。
				1.轻症限制进水量
				记录24小时出入水量，使入水量少于尿量。或适当加用利尿药，以依尼酸（利尿酸）和呋塞米等袢利尿药为首选。
				2.急重症水过多和水中毒
				治疗要以保护心、脑功能为目标，以脱水和（或）纠正低渗为目的。
				（1）高容量综合征为主者 以脱水为主，减轻心脏负荷。首选呋塞米或依他尼酸等袢利尿药。对于有效循环血容量不足的患者，要注意补充有效血容量。危急病例可采取血液超滤治疗。明确为抗利尿激素分泌过多者，除病因治疗外，可选用碳酸锂、利尿药治疗。保护心脏、减轻心负荷可用硝普钠纳、硝酸甘油等血管扩张剂。
				（2）低渗血症（特别是已出现精神神经症状）者 应迅速纠正细胞内低渗状态，除限水、利尿外，应使用3%～5%氯化钠液，严密观察心肺功能等病情变化，调节剂量及调速，一般以分次补给为宜。可同时并用利尿药，以减少血容量。注意纠正钾代谢失常及酸中毒。
			</text>
		</s-popup>
		<s-popup v-model="bottomVisible6" position="bottom" round background="rgb(2,0,36) linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%)" height="500" >
			<text class="mypop">
				患肠道疾病的原因：
					一、胃炎（50%）：
					1、现已明确Hp感染为慢性胃炎的最主要的病因，有人将其称为Hp相关性胃炎。但其他物理性、化学性及生物性有害因素长期反复作用于易感人体也可引起本病。沙门菌、嗜盐菌、致病性大肠杆菌等可导致急性胃炎。
					2、年龄愈大，胃黏膜功能，“抵抗力”也愈差，容易受外界不利因素的影响而造成损伤。
					3、过冷、过热的食物和饮料，浓茶、咖啡、烈酒、刺激性调味品、过于粗糙的食物、药物(特别是非甾体类消炎药如何司匹林、吲哚美辛等)，均可刺激胃粘膜，破坏粘膜屏障。
					胃内异物或胃石、胃区放射治疗均可作为外源性刺激，导致本病。情绪波动、应激状态及体内各种因素引起的变态反应可作为内源性刺激而致病。
					二、肠炎（30%）：
					1、病毒性肠炎：
					病毒性肠炎见于犬瘟热病毒、犬细小病毒、犬猫冠状病毒等引起的肠炎。在病毒性肠炎中，轮状病毒是婴幼儿腹泻的主要病因，而诺瓦克病毒是成人和大龄儿童流行性病毒性胃肠炎的主要病因。
					2、细菌性肠炎：
					细菌性肠炎见大肠杆菌、沙门菌、耶尔森菌(引起小肠结肠炎)、毛样产芽胞杆菌、空肠弯曲杆菌、梭菌(犬出血性胃肠炎)等引起的肠炎。细菌性肠炎的致病菌以痢疾杆菌最常见，其次为空肠弯曲菌和沙门菌。
					3、真菌性肠炎：
					真菌性肠炎见组织胞浆菌、藻状菌、曲霉菌、白念珠菌等引起的肠炎。真菌性肠炎以白色念珠菌引起的最多。
					4、寄生虫性肠：
					寄生虫性肠炎见鞭毛虫、球虫、弓形虫、蛔虫、钩虫等引起的肠炎。寄生虫引起的肠炎以溶组织内阿米巴较为常见。
					5、饮食导致的肠炎：
					污染或腐败变质食物、刺激性化学物质、某些重金属中毒，以及某些变态反应等都能引起肠炎。
					6、抗生素导致的肠炎：
					滥用抗生素，导致肠道菌群失调，或出现耐抗生素菌株而引起的肠炎。
					三、胃溃疡（10%）：
					1、遗传因素 胃溃疡有时有家族史，尤其儿童溃疡患者有家族史者可占25%～60%。另外A型血的人比其他血型的人易患此病。
					2、化学因素 长期饮用酒精或长期服用阿司匹林、皮质类固醇等药物易致此病发生，此外长期吸烟和饮用浓茶似亦有一定关系。
					3、生活因素 溃疡病患者在有些职业如司机和医生等人当中似乎更为多见，可能与饮食欠规律有关。工作过于劳累也可诱发本病发生。
					四、十二指肠溃疡（10%）：
					十二指肠溃疡的致病因素比较复杂，在过去20余年的时间里，十二指肠溃疡被认为是一种多因素所致的疾病。或多种有害对黏膜的破坏超过其抵御损伤和修复的能力。直到近期，十二指肠溃疡仍被认为是一种终生疾病。不过近来这种认为多种生物和环境因素仅对易感者发生有害作用的看法已逐渐被以下认识所取代。 
				症状：
					腹痛,从上腹或脐周疼痛转称至右下腹，右下腹有固定压痛，炎症扩展至浆层后有腹肌紧张和反跳痛。
				处理办法：
					可通过食疗进行预防，病情严重请及时就医。
			</text>
		</s-popup>
		<s-popup v-model="bottomVisible7" position="bottom" round background="rgb(2,0,36) linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%)" height="500" >
			<text class="mypop">
				患坐骨神经痛的原因：
					病因多种多样。绝大多数患者的坐骨神经痛是继发于坐骨神经局部及周围结构的病变对坐骨神经的刺激压迫与损害，称为继发坐骨神经痛；少数系原发性，即坐骨神经炎。
				症状：
					1、刀割样疼痛
					坐骨神经痛患者会出现脊柱侧弯刀割样疼痛、小腿外侧和足背感觉减退、臀肌张力松弛、跟腱反射减弱或消失等现象就越严重，甚至还会有可能造成瘫痪。
					2、腰部僵硬不适
					坐骨神经痛的症状表现多为腰部僵硬有不适感，步行或活动时腰及下肢出现短暂疼痛，可逐渐发展为剧烈烧灼或刀割样疼痛，沿坐骨神经走行放射，坐骨神经痛患者可自腰、臀部直达大腿、小腿后外侧及足外侧部。
					3、慢性损伤疼痛
					急性腰部损伤或慢性损伤急性发作，严重影响生活，疼痛体征呈典型放射性坐骨神经痛。检查时有明显肌肉松弛、萎缩，直腿拾高试验在三十度以内，神经反射减弱或消失。百分之九十以上由腰椎间盘突出症引起。
					4、跛行
					当坐骨神经痛达到一定程度以后，会出现跛行的症状，患者在没接受相关治疗，不以为然的时候，坐骨神经痛慢慢的就会演变成为跛行的症状，跛行也是坐骨神经痛最重要的一个症状，也是坐骨神经痛的危害表现。
					5、干性坐骨神经痛
					起病缓急也随病因不同而异，如受寒或外伤诱发者多急性起病，疼痛常从臀部向股后，小腿后外侧及足外侧放射，行走，活动及牵引坐骨神经时疼痛加重，压痛点在臀点以下，Lasegue征阳性而Kernig征多阴性，脊椎侧弯多弯向患侧以减轻对坐骨神经干的牵拉。
				处理办法：
					1、辅助治疗
					病症的治疗方法有很多，疼痛发作时，可用冰敷患处30-60分钟，每天数次，连续二至三天，然后以同样的间隔用热水袋敷患处，每日睡前用热毛巾或布包的热盐热敷腰部或臀部，温度不可太高，以舒适为宜。这也属于坐骨神经痛的治疗措施。
					2、物理治疗
					积极锻炼腰部肌肉力量，增加腰椎前韧带，后韧带及侧韧带的力量，避免椎间盘受压迫突破人体正常韧带，肌肉的保护。这也是坐骨神经痛的治疗方法之一。
					3、运动疗法
					患者坐于床沿或椅上，双腿垂地，足跟着地，足尖翘起，双手平放腿上。坐好后逐步向前弯腰，双手推向足部。初练时双手可能仅能达到小腿部，坚持锻炼后能够达到足背和足尖。这也是坐骨神经痛的治疗方式。
			</text>
		</s-popup>
		<s-popup v-model="bottomVisible8" position="bottom" round background="rgb(2,0,36) linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%)" height="500" >
			<text class="mypop">
				感冒的原因：
					鼻病毒、副流感病毒、呼吸道合胞病毒、埃可病毒、柯萨奇病毒、冠状病毒、腺病毒等病毒感染引起。
				症状：
					本病起病较急，潜伏期1～3天，主要表现为鼻部症状，如喷嚏、鼻塞、流清水样鼻涕，也可表现为咳嗽、咽干、咽痒、咽痛或灼热感，甚至鼻后滴漏感。2～3天后鼻涕变稠，常伴咽痛、流泪、味觉减退、呼吸不畅、声嘶等。一般无发热及全身症状，或仅有低热、不适、轻度畏寒、头痛。
				处理办法：
					一般治疗包括注意休息，多饮水，饮食要容易消化，注意通风等。缓解症状可使用药物治疗。
					1.解热镇痛药
					包括复方阿司匹林、吲哚美辛、对乙酰氨基酚、布洛芬等药物，适用于发热、肌肉酸痛、头痛的患者。对于严重肝肾功能不全、有出血倾向、上消化道出血等人群，不宜使用此类药物。
					2.抗组胺药
					如马来酸氯苯那敏,对减少打喷嚏和鼻溢效果显著。
					3.镇咳药
					对于剧烈咳嗽，甚至影响休息时，可适量使用镇咳药，以右美沙芬的应用较多。
					4.拟肾上腺素药
					对于鼻塞、鼻黏膜充血水肿的患者，可以使用盐酸伪麻黄碱等药物。
			</text>
		</s-popup>
		<s-popup v-model="bottomVisible9" position="bottom" round background="rgb(2,0,36) linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%)" height="500" >
			<text class="mypop">
				四肢发凉的原因：
					手脚冰冷和心脏血管有很大的关系，因为血液是由心脏发出，携带氧气到全身各部位，糖经过氧化后，才能产生热能，手脚才会温暖。一旦心血管系统的功能出现障碍，就会影响血液运行输送，造成手脚冰冷的情形。
					从中医的观点来看，手脚容易冰冷、麻木，多是属于气血的毛病，因为气虚、血虚所造成的血液运行不畅、血液量不足，要补气补血。
				处理办法：
					不迷恋小短裙
					保温，在中医看来是女人养生的重中之重。因为女人是靠血养的，只有血行畅通、充盈，身体和容颜才会有营养供应。而血有“得热则行，遇寒则凝”的特性，所以当身体受到外界寒气的侵袭，就必然会阻碍了气血的运行。这时，就算花大钱买高级的保养品或者补血中药，这些营养也只会积聚在体内，无法达到用武之地。因此，对女人来说保温是首要任务。
					所谓保温，无非就是多穿衣服，不要爱露。但偏偏很多年轻的女孩子不爱听，平时爱穿“露脐装”、“露背装”，甚至大冷天还穿迷你裙，旁边的人看着都觉得冷。请大家记住，寒是女人诸多疾病的诱因和症结，特别是腰以下的部位，一旦受凉，后患无穷。
					告别冷饮冷食
					在中医养生传统中，女性体质属阴，不可以贪凉。吃了过多寒凉、生冷的食物后，这些食物进入体内会消耗阳气，导致寒邪内生，侵害子宫。正如在冬天我们会喝点热汤吃点热食，吃过以后身体多少会有点回暖。而如果我们吃冷食喝冷饮，身体也会明显觉得冷。所以，女人要尽量吃有温度的食物，尽量少吃冰激凌、生冷的食物。
					有些女生为了减肥，天天不吃饭，只吃水果、蔬菜等，还以为这样既健康又“排毒”。其实很多瓜果也是寒性的，平时我们按照食物金字塔来进食的话，瓜果中的寒性能跟其他食物抵消，所以不会对身体有害。但如果作为主食，甚至完全不吃其他东西，那瓜果的寒邪就会消耗掉我们自身的阳气了。
					多做运动
					建议你一早起来做做运动，快走是最佳选择。慢跑、快步走、跳绳、跳迪斯科、打太极拳等，都会让全身各个部位活动起来，促进血液循环，但不可运动过度，高强度的运动，大量的出汗，会“发泄阳气”，起到相反的作用。用比走路快、比跑步慢的速度。
					保暖泡脚
					泡脚是最有效的方法。在较深的盆中加入40度左右的热水，让水漫过脚踝。浸泡20分钟左右，就会感觉到全身发热，这说明血液循环畅通后身体开始发热。如果在泡脚的同时再揉搓双脚，效果会更好。
					纯棉袜子不仅柔软舒适，还可吸收脚汗，让双脚整天都能保持干爽舒适，并能抵御外界的寒冷。
					坚持按摩穴位
					有时间的时候可以经常揉搓手脚心，以改善末端血管的微循环状况，并具有手脚温暖的效果，或按摩穴位，也可以改善手脚冰凉的症状。
					揉搓涌泉穴：涌泉穴位于脚心部，用手掌快速揉搓，直到有热感为佳，每天早晚揉搓涌泉穴100下，接着揉搓各脚趾100下。中医学认为，人体诸多经脉都汇集于足底，与全身各脏腑、组织、器官都有密切关系。尤其是刺激涌泉穴，有益于补肾壮阳、强筋壮骨。坚持揉搓此穴会促使手脚冰凉症状减轻。
					揉搓劳宫穴：劳宫穴位于手心部。一手握拳，揉搓另一只手的手心部，直到感到手心微热，再换另一只手，交替进行。
					按揉气冲穴：气冲穴位于大腿根里侧，此穴下边有一根动脉。先按揉气冲穴，后按揉动脉，一松一按，交替进行，一直按揉到腿脚有热气下流的感觉为佳。
					按揉、拍打肾俞穴：肾俞穴位于两边腰眼，轻轻用力，两边各拍打100余次。
			</text>
		</s-popup>
		<s-popup v-model="bottomVisible10" position="bottom" round background="rgb(2,0,36) linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%)" height="500" >
			<text class="mypop">
				皮肤过敏原因：
					外因
					包括饮食、吸入物、气候、接触过敏物因素等。其中海鲜、蛋白质，辛辣食品、酒、吸入花粉、尘螨、寒冷天气、接触化学物品、肥皂、洗涤剂等是皮肤过敏最常见的诱因。
					内因
					过敏物质与支气管粘膜， 鼻粘膜， 皮肤血管相结合，产生喷嚏流涕的过敏性鼻炎，喘憋不止的过敏性哮喘，瘙痒皮症的过敏性皮炎等。在过敏反应的发生过程中，过敏介质起着直接的作用，过敏原是过敏病症发生的外因，而机体免疫能力低下，大量自由基对肥大细胞和嗜碱粒细胞的氧化破坏是过敏发生的内因。
					此外，根据中医理论和最新的研究成果表明，过敏主要是风、湿、热邪蕴于血液和肌肤所致，或因血热又感外风而发病。即与人体中的血液中含有一定的毒素有相当关系。
			症状：
				1．皮肤表皮薄，细腻白皙，皮脂分泌少，较干燥，微血管明显，皮肤呈现干燥机能减退，角质层保持水分的能力降低，肌肤表面的皮脂膜形成不完全。
				2．接触化妆品或季节过敏后易引起皮肤过敏，出现红、肿、痒。皮肤缺乏光泽，脸颊易充血红肿。
				3．因季节变化而使皮肤容易呈现不稳定的状态。主要症状是搔痒、烧灼感、刺痛、皮肤发痒和出小疹子。
				4．容易受冷风、食物、水质、紫外线、合成纤维、香味、色素等外在环境或物质的影响。
				5．当接触到刺激性物质就会引发肌肤的问题。对阳光、气候、水、植物（花粉）、化妆品、香水、蚊虫叮咬及高蛋白食物都有可能导致过敏。
			处理办法：
				远离过敏源，严重时请及时就医。
			</text>
		</s-popup>
		<s-popup v-model="bottomVisible11" position="bottom" round background="rgb(2,0,36) linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%)" height="500" >
			<text class="mypop">
				皮炎湿疹原因：
					外因
					主要是生活工作环境以及饮食。研究显示，湿热、摩擦、日光、搔抓、化装品、肥皂、干燥、皮毛、燃料、人造纤维等均可诱发湿疹，而某些食物如鱼虾、蛋等也可使湿疹加重。
					内因
					研究发现，皮炎湿疹具有一定的遗传因素，也与人体是不是过敏体质有关。随着年龄、环境的改变，神经因素如忧虑等因素引起皮炎湿疹。此外，内分泌，代谢及胃肠功能障碍，感染病灶等与发病也有关系。
			症状：
				过敏性皮炎湿疹是一种非常严重的皮肤病，一般在夏季发生率最高。在早期或急性阶段，患处有成片的红斑，密集或疏散的小丘疹，或是肉眼难见的水疱，严重时有大片渗液及糜烂
			处理办法：
				一、忌搔抓搔抓可使皮肤不断遭受机械性刺激而变厚，甚至引起感染。搔抓还起强化作用，病人愈搔愈痒，愈痒愈抓，形成恶性循环，病程因而延长。
				二、忌热水烫洗皮炎、湿疹在急性期，由于皮内毛细血管扩张，会有不同程度的皮肤红肿、丘疹、水疱。用热水烫洗或浸泡，红肿加重，渗透液增多，加重病情。因此，皮炎、湿疹病人宜用温水淋浴，切忌在热水内浸泡和用力搓擦。
				三、忌肥皂洗特别是碱性大的肥皂，对皮肤是一种化学性刺激，可使皮炎、湿疹加重。若需用肥皂去污时，最好选择刺激性较小的硼酸皂。
				四、忌刺激性食物辣椒、酒、浓茶、咖啡等刺激食物，容易使湿疹加重或复发，都应禁忌。
				五、忌盲目用药皮炎、湿疹病程较长，易反复。
				六、要搞好个人卫生，经常洗澡，同时水温不宜过高，以30摄氏度至40摄氏度为宜。
			</text>
		</s-popup>
	</view>

</template>

<script>
	export default {
	    data() {
	        return {
				bottomVisible1: false,
				bottomVisible2: false,
				bottomVisible3: false,
				bottomVisible4: false,
				bottomVisible5: false,
				bottomVisible6: false,
				bottomVisible7: false,
				bottomVisible8: false,
				bottomVisible9: false,
				bottomVisible10: false,
				bottomVisible11: false,
				show: false
			}
	    },
	    methods: {

			
	    }
	}
</script>

<style lang="scss">
	.form-control{
		margin: 10% 2.5% 40upx;
		width:95%;
		padding:6px 12px;
		font-size:14px;
		color:#555;
		background-color:#fff;
		background-image: none;
		border:1px solid #ccc;
		border-radius:4px;
	}
	.button-style{
		margin: 2% 77% 40upx;
		width:20%;
	}
	.blueBtn {
		width: 500rpx;
		margin: 50rpx auto;
		display: block;
		line-height: 80rpx;
	}
	.mybutton{
		 background-color:transparent;
		 color: #f1f0ed;
		 font-size: 50rpx;
		 font-weight: 550;
	}
	.mybg{
		background: rgb(2,0,36);
		background: linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%);
		background-size:100% 100%;
	}
	.blueBtn {
		width: 600rpx;
		margin: 50rpx auto;
		display: block;
		line-height: 80rpx;
	}
	.mypop{
		color: black;
		background: rgb(2,0,36);
		background: linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%);
		user-select: "true";
		font-family:"微软雅黑";
		display: block;
		margin: 20rpx;
		font-size: 45rpx;
		
		width: 95%;
		height: 95%;
		overflow-y: scroll;
	}
</style>