<template>
	<view class="components-home mybg">
		<cu-custom bgColor="bg-gradual-blue" :isBack="true">
			<block slot="backText">返回</block>
			<block slot="content">安全知识</block>
		</cu-custom>
		<u-notice-bar :text="text1" mode="closable"></u-notice-bar>
		<view>
			<button block @click="bottomVisible1 = true" class="mybutton">肚子痛了怎么办？</button>
			<button block @click="bottomVisible2 = true" class="mybutton">迷路了怎么办？</button>
			<button block @click="bottomVisible3 = true" class="mybutton">中暑怎么办？</button>
			<button block @click="bottomVisible4 = true" class="mybutton">热中风了怎么办？</button>
			<button block @click="bottomVisible5 = true" class="mybutton">水中毒了怎么办？</button>
			<button block @click="bottomVisible6 = true" class="mybutton">孩子走丢怎么办？</button>
			<button block @click="bottomVisible8 = true" class="mybutton">感冒怎么样好得快？</button>
			<button block @click="bottomVisible9 = true" class="mybutton">经常四肢发凉怎么处理？</button>
			<button block @click="bottomVisible10 = true" class="mybutton">皮肤过敏怎么处理？</button>
			<button block @click="bottomVisible11 = true" class="mybutton">皮炎湿疹怎么处理？</button>
			<button block @click="bottomVisible11 = true" class="mybutton">皮炎湿疹怎么处理？</button>
			<button block @click="bottomVisible11 = true" class="mybutton">皮炎湿疹怎么处理？</button>
			<button block @click="bottomVisible11 = true" class="mybutton">皮炎湿疹怎么处理？</button>

		</view>

		<s-popup v-model="bottomVisible1" position="bottom" round
			background="rgb(2,0,36) linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%)"
			height="500">
			<text class="mypop">
				肚子痛的原因:
				一、饭钱饭后疼痛可能是胃炎
				如果经常在饭钱饭后出现疼痛的话，那么就需要注意，因为这种情况可能是胃炎导致的，胃炎的影响还是比较大的，不仅影响食欲更会影响心情，对于胃炎一般来说主要通过药物进行治疗。
				二、如果肚脐附近经常疼痛要考虑是否为小肠病变
				众所周知，人的肚脐位置主要是小肠，所以如果是这个部位的疼痛，可以去医院检查一下看是否为小肠病变导致的。
				三、右下腹疼痛可能是阑尾炎
				当饭后出现右下腹疼痛的情况，可以考虑一下是否是患上了阑尾炎导致的。
				四、暴食后疼痛可能是急性胃扩张
				生活节奏快、精神压力大，很多人会选择通过暴饮暴食来减肥，如果短时间内吃太多的食物会导致急性胃扩张，其主要症状表现就是肚子疼痛难忍，对于此类情况需要及时去医院接受治疗，以免发生危险。
				五、吃生冷食物后导致疼痛多是肠易激综合征
				很多朋友在吃了生冷的食物之后，就非常容易出现腹泻、肚子不舒服的情况，这种一般是肠易激综合征所导致的，虽然说这种问题不会给我们的生命带来威胁，但是也会降低我们的生活质量，给日常生活和工作带来很多的不便，所以要及时的治疗。
				六、疼痛时还有烧心的感觉，有可能是胃食管反流导致
				如果在肚子疼痛的同时，出现烧心以及食欲减退的情况，则有可能是胃食管反流导致的，这种情况下应该避免油腻辛辣刺激食物、拒绝碳酸饮料、避免进食过多等等。
				七、肋骨交界处疼痛需要高度警惕
				当肚子疼的时候伴随肋骨交界处疼痛，则有可能是心脏疾病，尤其是中老年人对于此类情况需要高度重视，及早去医院检查。
				处理办法：
				请根据自身情况判断是否需要去医院。
			</text>
		</s-popup>
		<s-popup v-model="bottomVisible2" position="bottom" round
			background="rgb(2,0,36) linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%)"
			height="500">
			<text class="mypop">
				1、在景区迷路时应停止前进，并尽快冷静下来。
				2、若是因不小心与其他队员分开而迷路，应立即大声呼唤同伴，或吹哨子发求助信号。
				3、如果手机有信号，马上和其他队员或当地有关单位联系，请求救援，最为安全的就是在原地或有明显标志物的地方等待救援。
				4、仔细回忆一下刚才走过的路、见过的泉水、岩石、大树、河流、洞穴、山峰、岔路口等参照物，然后凭自己的记忆寻找自己的足迹，退回到原来的路线上。
				5、如果遇到岔路口，首先要明确要去的方向，然后选择正确的道路。若几条道路方向大致相同，无法判定，则应先走中间那条路，这样可以左右逢源，即使走错了路也不会偏差太远。
				6、在山地迷失方向后，如判断不准方向，可先登高远望，根据太阳或远方的参照物，如村庄、水库、公路等，判断应该向什么方向走。若自己无法判定方向，则应朝地势低的方向走，这样容易碰到水源。

			</text>
		</s-popup>
		<s-popup v-model="bottomVisible3" position="bottom" round
			background="rgb(2,0,36) linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%)"
			height="500">
			<text class="mypop">
				中暑的原因：
				中暑是指在温度或湿度较高、不透风的环境下，因体温调节中枢功能障碍或汗腺功能衰竭，以及水、电解质丢失过多，从而发生的以中枢神经和（或）心血管功能障碍为主要表现的急性疾病。
				症状：
				出现头痛、头晕、口渴、多汗等症状
				处理办法：
				先兆中暑和轻度中暑患者一般经现场救护可以恢复正常。严重者请前往医院
			</text>
		</s-popup>
		<s-popup v-model="bottomVisible4" position="bottom" round
			background="rgb(2,0,36) linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%)"
			height="500">
			<text class="mypop">
				热中风的原因：
				热中风一般都是由于天气比较热，而且这段时间经常外出所导致的，中风一般老年人患病比较多，而且可能会出现头晕的情况，热中风一般可能会出现恶心呕吐的情况，也有可能会出现失眠多梦。在日常生活中一定要注意有一个良好的睡眠质量发生热中风之后一定要及时的送往医院，避免延误病。
				症状：
				发生热中风的前兆主要有：血压突然大幅度波动，且伴有 头昏眼花或耳鸣耳聋；头昏头痛突然加重或由间断性头痛变为
				持续性剧烈的头痛，伴有恶心呕吐；突然出现一时性一侧肢体发麻、无力，或活动不灵，或口舌发麻，吐字不清；精神和性 格突然发生改变，变得沉默寡言、表情淡漠，或急躁多语、烦躁
				不安，或出现短暂的判断和智力障碍，或突然发生嗜睡状态，即昏昏沉沉总想睡觉；严重者突然发生原 因不明的跌跋和昏倒等。
				处理办法：
				由于高温散热的需要，血流向外周皮肤分配，造成大脑血流量的锐减，这对心血管调节功能不良及因脑动脉硬化原本供血不足的病人，将进一步加剧大脑的缺血，从而诱发脑梗塞；高温酷热易使人心情烦躁，情绪变化较大，引起血压波动，继而诱发中风。治疗与普通中风基本一样，控制症状，溶栓治疗。建议去3甲医院就诊治疗。
			</text>
		</s-popup>
		<s-popup v-model="bottomVisible5" position="bottom" round
			background="rgb(2,0,36) linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%)"
			height="500">
			<text class="mypop">
				水中毒的原因：
				1.抗利尿激素（ADH）泌过多
				各种原因导致的抗利尿激素分泌过多，可见于恐惧、失血、休克、急性感染（如肺炎、中毒性痢疾等）、应用止痛剂（如吗啡、哌替啶），或疼痛、手术等应激刺激。手术后ADH分泌增多的时间通常持续12～36小时，或更长。在此情况下过多输入葡萄糖等不含电解质的溶液，就容易发生水中毒。此外甲状腺功能低下的晚期发生部液性水肿的患者也可以通过压力感受器的刺激使ADH分泌增多，肾上腺皮质功能不全时也可有ADH的异常释放。
				2.肾功能障碍
				急性肾衰竭的少尿无尿期，肾脏的稀释和浓缩功能都发生障碍，此时水分摄入过多，容易发生水中毒。此外，任何原因使肾血流量不足或肾小球血液灌注量严重减少，过多的水分不能排出，在合并低渗性的情况下，水中毒容易发生。
				3.入水过多
				机体摄入过多的水分，如慢性精神病患者的原发性多饮。某些医源性因素如静脉输液过多、催产素或垂体后叶素的应用。此时细胞外液量明显增加，血清钠浓度降低，渗透压亦下降，导致过多的水进入细胞内。
				症状：
				1.急性水中毒
				发病急，由于细胞内外液量增多，颅腔和椎管无弹性，脑细胞水肿造成颅内压增高症状，如头痛，失语，精神错乱，定向力失常，嗜睡，躁动，谵妄，甚至昏迷，进一步发展，有发生脑疝的可能，以致呼吸、心跳骤停。重者有充血性心力衰竭、呼吸急促（发生肺水肿时）、胸腔积液、充血性肝肿大、颈静脉怒张、肺动脉压和中心静脉压增高、骶部或四肢末端的水肿。若血钠在48小时内迅速降至108mmol/L以下，可致神经系统永久性损伤或死亡。
				2.慢性水中毒
				症状一般不明显，往往被原发疾病的症状所掩盖，可有软弱无力，恶心呕吐，嗜睡等，体重增加，皮肤苍白而湿润。当血浆渗透压降至240～250mOsm/L（血钠115～120mmol/L）时，会出现头痛、嗜睡、神志错乱、谵妄等神经精神症状。当血浆渗透压降至230mOsm/L（血钠110mmol/L）时，可发现抽搐或昏迷。
				处理办法：
				水中毒一经诊断应立即停止水分摄入，并积极治疗原发疾病。
				1.轻症限制进水量
				记录24小时出入水量，使入水量少于尿量。或适当加用利尿药，以依尼酸（利尿酸）和呋塞米等袢利尿药为首选。
				2.急重症水过多和水中毒
				治疗要以保护心、脑功能为目标，以脱水和（或）纠正低渗为目的。
				（1）高容量综合征为主者
				以脱水为主，减轻心脏负荷。首选呋塞米或依他尼酸等袢利尿药。对于有效循环血容量不足的患者，要注意补充有效血容量。危急病例可采取血液超滤治疗。明确为抗利尿激素分泌过多者，除病因治疗外，可选用碳酸锂、利尿药治疗。保护心脏、减轻心负荷可用硝普钠纳、硝酸甘油等血管扩张剂。
				（2）低渗血症（特别是已出现精神神经症状）者
				应迅速纠正细胞内低渗状态，除限水、利尿外，应使用3%～5%氯化钠液，严密观察心肺功能等病情变化，调节剂量及调速，一般以分次补给为宜。可同时并用利尿药，以减少血容量。注意纠正钾代谢失常及酸中毒。
			</text>
		</s-popup>
		<s-popup v-model="bottomVisible6" position="bottom" round
			background="rgb(2,0,36) linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%)"
			height="500">
			<text class="mypop">
				带娃出行，之所以觉得特别累，不仅因为孩子经常需要我们抱着，更担心孩子可能走丢的情况。景区游客多，大人如果一不留神，孩子可能就被淹没在人海中，一旦丢失，后悔都没用了。
				那么如何预防孩子可能丢失情况？
				首先，在带娃旅游前，一定要严肃告诉孩子，去景区可能存在的危险，所以一定不能乱走，必须紧跟大人身边。如果走丢，学会拨打大人手机号码或者直接打110报警。
				其次，作为家长，我们在景区时候，一定要看顾好自己的孩子，特别是人流量多的景区，最好抱着或者用防走丢牵引绳等，总之，要确保孩子在自己视力范围内。
				最后，一定不要让陌生人帮忙照顾孩子，自己孩子自己照顾，即使去洗手间，也要带着孩子一起。
				但是如果孩子确实在旅途中走失了怎么办？
				那就是第一时间报警，一定要及时报警，相信警方的力量。等报警后，我们再找到景区负责人，说明情况，让景区负责人帮忙通过广播或者别的方式一起寻找孩子，可以去孩子喜欢的或者感兴趣的地方寻找，并且要大声呼喊孩子名字，尽量让孩子可以听到。
			</text>
		</s-popup>
		<s-popup v-model="bottomVisible8" position="bottom" round
			background="rgb(2,0,36) linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%)"
			height="500">
			<text class="mypop">
				感冒的原因：
				鼻病毒、副流感病毒、呼吸道合胞病毒、埃可病毒、柯萨奇病毒、冠状病毒、腺病毒等病毒感染引起。
				症状：
				本病起病较急，潜伏期1～3天，主要表现为鼻部症状，如喷嚏、鼻塞、流清水样鼻涕，也可表现为咳嗽、咽干、咽痒、咽痛或灼热感，甚至鼻后滴漏感。2～3天后鼻涕变稠，常伴咽痛、流泪、味觉减退、呼吸不畅、声嘶等。一般无发热及全身症状，或仅有低热、不适、轻度畏寒、头痛。
				处理办法：
				一般治疗包括注意休息，多饮水，饮食要容易消化，注意通风等。缓解症状可使用药物治疗。
				1.解热镇痛药
				包括复方阿司匹林、吲哚美辛、对乙酰氨基酚、布洛芬等药物，适用于发热、肌肉酸痛、头痛的患者。对于严重肝肾功能不全、有出血倾向、上消化道出血等人群，不宜使用此类药物。
				2.抗组胺药
				如马来酸氯苯那敏,对减少打喷嚏和鼻溢效果显著。
				3.镇咳药
				对于剧烈咳嗽，甚至影响休息时，可适量使用镇咳药，以右美沙芬的应用较多。
				4.拟肾上腺素药
				对于鼻塞、鼻黏膜充血水肿的患者，可以使用盐酸伪麻黄碱等药物。
			</text>
		</s-popup>
		<s-popup v-model="bottomVisible9" position="bottom" round
			background="rgb(2,0,36) linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%)"
			height="500">
			<text class="mypop">
				四肢发凉的原因：
				手脚冰冷和心脏血管有很大的关系，因为血液是由心脏发出，携带氧气到全身各部位，糖经过氧化后，才能产生热能，手脚才会温暖。一旦心血管系统的功能出现障碍，就会影响血液运行输送，造成手脚冰冷的情形。
				从中医的观点来看，手脚容易冰冷、麻木，多是属于气血的毛病，因为气虚、血虚所造成的血液运行不畅、血液量不足，要补气补血。
				处理办法：
				不迷恋小短裙
				保温，在中医看来是女人养生的重中之重。因为女人是靠血养的，只有血行畅通、充盈，身体和容颜才会有营养供应。而血有“得热则行，遇寒则凝”的特性，所以当身体受到外界寒气的侵袭，就必然会阻碍了气血的运行。这时，就算花大钱买高级的保养品或者补血中药，这些营养也只会积聚在体内，无法达到用武之地。因此，对女人来说保温是首要任务。
				所谓保温，无非就是多穿衣服，不要爱露。但偏偏很多年轻的女孩子不爱听，平时爱穿“露脐装”、“露背装”，甚至大冷天还穿迷你裙，旁边的人看着都觉得冷。请大家记住，寒是女人诸多疾病的诱因和症结，特别是腰以下的部位，一旦受凉，后患无穷。
				告别冷饮冷食
				在中医养生传统中，女性体质属阴，不可以贪凉。吃了过多寒凉、生冷的食物后，这些食物进入体内会消耗阳气，导致寒邪内生，侵害子宫。正如在冬天我们会喝点热汤吃点热食，吃过以后身体多少会有点回暖。而如果我们吃冷食喝冷饮，身体也会明显觉得冷。所以，女人要尽量吃有温度的食物，尽量少吃冰激凌、生冷的食物。
				有些女生为了减肥，天天不吃饭，只吃水果、蔬菜等，还以为这样既健康又“排毒”。其实很多瓜果也是寒性的，平时我们按照食物金字塔来进食的话，瓜果中的寒性能跟其他食物抵消，所以不会对身体有害。但如果作为主食，甚至完全不吃其他东西，那瓜果的寒邪就会消耗掉我们自身的阳气了。
				多做运动
				建议你一早起来做做运动，快走是最佳选择。慢跑、快步走、跳绳、跳迪斯科、打太极拳等，都会让全身各个部位活动起来，促进血液循环，但不可运动过度，高强度的运动，大量的出汗，会“发泄阳气”，起到相反的作用。用比走路快、比跑步慢的速度。
				保暖泡脚
				泡脚是最有效的方法。在较深的盆中加入40度左右的热水，让水漫过脚踝。浸泡20分钟左右，就会感觉到全身发热，这说明血液循环畅通后身体开始发热。如果在泡脚的同时再揉搓双脚，效果会更好。
				纯棉袜子不仅柔软舒适，还可吸收脚汗，让双脚整天都能保持干爽舒适，并能抵御外界的寒冷。
				坚持按摩穴位
				有时间的时候可以经常揉搓手脚心，以改善末端血管的微循环状况，并具有手脚温暖的效果，或按摩穴位，也可以改善手脚冰凉的症状。
				揉搓涌泉穴：涌泉穴位于脚心部，用手掌快速揉搓，直到有热感为佳，每天早晚揉搓涌泉穴100下，接着揉搓各脚趾100下。中医学认为，人体诸多经脉都汇集于足底，与全身各脏腑、组织、器官都有密切关系。尤其是刺激涌泉穴，有益于补肾壮阳、强筋壮骨。坚持揉搓此穴会促使手脚冰凉症状减轻。
				揉搓劳宫穴：劳宫穴位于手心部。一手握拳，揉搓另一只手的手心部，直到感到手心微热，再换另一只手，交替进行。
				按揉气冲穴：气冲穴位于大腿根里侧，此穴下边有一根动脉。先按揉气冲穴，后按揉动脉，一松一按，交替进行，一直按揉到腿脚有热气下流的感觉为佳。
				按揉、拍打肾俞穴：肾俞穴位于两边腰眼，轻轻用力，两边各拍打100余次。
			</text>
		</s-popup>
		<s-popup v-model="bottomVisible10" position="bottom" round
			background="rgb(2,0,36) linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%)"
			height="500">
			<text class="mypop">
				皮肤过敏原因：
				外因
				包括饮食、吸入物、气候、接触过敏物因素等。其中海鲜、蛋白质，辛辣食品、酒、吸入花粉、尘螨、寒冷天气、接触化学物品、肥皂、洗涤剂等是皮肤过敏最常见的诱因。
				内因
				过敏物质与支气管粘膜， 鼻粘膜，
				皮肤血管相结合，产生喷嚏流涕的过敏性鼻炎，喘憋不止的过敏性哮喘，瘙痒皮症的过敏性皮炎等。在过敏反应的发生过程中，过敏介质起着直接的作用，过敏原是过敏病症发生的外因，而机体免疫能力低下，大量自由基对肥大细胞和嗜碱粒细胞的氧化破坏是过敏发生的内因。
				此外，根据中医理论和最新的研究成果表明，过敏主要是风、湿、热邪蕴于血液和肌肤所致，或因血热又感外风而发病。即与人体中的血液中含有一定的毒素有相当关系。
				症状：
				1．皮肤表皮薄，细腻白皙，皮脂分泌少，较干燥，微血管明显，皮肤呈现干燥机能减退，角质层保持水分的能力降低，肌肤表面的皮脂膜形成不完全。
				2．接触化妆品或季节过敏后易引起皮肤过敏，出现红、肿、痒。皮肤缺乏光泽，脸颊易充血红肿。
				3．因季节变化而使皮肤容易呈现不稳定的状态。主要症状是搔痒、烧灼感、刺痛、皮肤发痒和出小疹子。
				4．容易受冷风、食物、水质、紫外线、合成纤维、香味、色素等外在环境或物质的影响。
				5．当接触到刺激性物质就会引发肌肤的问题。对阳光、气候、水、植物（花粉）、化妆品、香水、蚊虫叮咬及高蛋白食物都有可能导致过敏。
				处理办法：
				远离过敏源，严重时请及时就医。
			</text>
		</s-popup>
		<s-popup v-model="bottomVisible11" position="bottom" round
			background="rgb(2,0,36) linear-gradient(143deg, rgba(2,0,36,1) 0%, rgba(92,233,247,1) 0%, rgba(78,92,218,1) 100%)"
			height="500">
			<text class="mypop">
				皮炎湿疹原因：
				外因
				主要是生活工作环境以及饮食。研究显示，湿热、摩擦、日光、搔抓、化装品、肥皂、干燥、皮毛、燃料、人造纤维等均可诱发湿疹，而某些食物如鱼虾、蛋等也可使湿疹加重。
				内因
				研究发现，皮炎湿疹具有一定的遗传因素，也与人体是不是过敏体质有关。随着年龄、环境的改变，神经因素如忧虑等因素引起皮炎湿疹。此外，内分泌，代谢及胃肠功能障碍，感染病灶等与发病也有关系。
				症状：
				过敏性皮炎湿疹是一种非常严重的皮肤病，一般在夏季发生率最高。在早期或急性阶段，患处有成片的红斑，密集或疏散的小丘疹，或是肉眼难见的水疱，严重时有大片渗液及糜烂
				处理办法：
				一、忌搔抓搔抓可使皮肤不断遭受机械性刺激而变厚，甚至引起感染。搔抓还起强化作用，病人愈搔愈痒，愈痒愈抓，形成恶性循环，病程因而延长。
				二、忌热水烫洗皮炎、湿疹在急性期，由于皮内毛细血管扩张，会有不同程度的皮肤红肿、丘疹、水疱。用热水烫洗或浸泡，红肿加重，渗透液增多，加重病情。因此，皮炎、湿疹病人宜用温水淋浴，切忌在热水内浸泡和用力搓擦。
				三、忌肥皂洗特别是碱性大的肥皂，对皮肤是一种化学性刺激，可使皮炎、湿疹加重。若需用肥皂去污时，最好选择刺激性较小的硼酸皂。
				四、忌刺激性食物辣椒、酒、浓茶、咖啡等刺激食物，容易使湿疹加重或复发，都应禁忌。
				五、忌盲目用药皮炎、湿疹病程较长，易反复。
				六、要搞好个人卫生，经常洗澡，同时水温不宜过高，以30摄氏度至40摄氏度为宜。
			</text>
		</s-popup>
	</view>

</template>

<script>
	export default {
		data() {
			return {
				text1: "请各位游客注意各个景点的安全注意事项！保护自己的身心安全。",
				bottomVisible1: false,
				bottomVisible2: false,
				bottomVisible3: false,
				bottomVisible4: false,
				bottomVisible5: false,
				bottomVisible6: false,
				bottomVisible7: false,
				bottomVisible8: false,
				bottomVisible9: false,
				bottomVisible10: false,
				bottomVisible11: false
			}
		}
	}
</script>

<style lang="scss">
	.form-control {
		margin: 10% 2.5% 40upx;
		width: 95%;
		padding: 6px 12px;
		font-size: 14px;
		color: #555;
		background-color: #fff;
		background-image: none;
		border: 1px solid #ccc;
		border-radius: 4px;
	}

	.button-style {
		margin: 2% 77% 40upx;
		width: 20%;
	}

	.blueBtn {
		width: 500rpx;
		margin: 50rpx auto;
		display: block;
		line-height: 80rpx;
	}

	.mybutton {
		background-color: transparent;
		color: #f1f0ed;
		font-size: 50rpx;
		font-weight: 550;
	}

	.mybg {
		background: rgb(2, 0, 36);
		background: linear-gradient(143deg, rgba(2, 0, 36, 1) 0%, rgba(92, 233, 247, 1) 0%, rgba(78, 92, 218, 1) 100%);
		background-size: 100% 100%;
	}

	.blueBtn {
		width: 600rpx;
		margin: 50rpx auto;
		display: block;
		line-height: 80rpx;
	}

	.mypop {
		color: black;
		background: rgb(2, 0, 36);
		background: linear-gradient(143deg, rgba(2, 0, 36, 1) 0%, rgba(92, 233, 247, 1) 0%, rgba(78, 92, 218, 1) 100%);
		user-select: "true";
		font-family: "微软雅黑";
		display: block;
		margin: 20rpx;
		font-size: 45rpx;
		width: 95%;
		height: 95%;
		overflow-y: scroll;
	}
</style>
